controllers/CargosController.php

    public function actionCreate()
    {
        $model = new Cargos();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO `cargos` (`cargo`, `detallecargo`) VALUES ('Docente', 'Carlos Huevo frito')

    protected function findModel($idcargos)
    {
        if (($model = Cargos::findOne(['idcargos' => $idcargos])) !== null) {
---
SELECT * FROM `cargos` WHERE `idcargos`='1'